_orgs/_drafts/2014-10-23-using-apache.org
#+TITLE:     My Note of Apache
#+AUTHOR:    赵仁贵
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:2 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD_EXTRA: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 
# (setq org-export-html-use-infojs nil)
 Please don't hesitate contact me if you have any questions about the article. 
# (setq org-export-html-style nil)

* Writing in the front
: Apache
* Virtual Host
** Configure virtual host
*** Enable "httpd-vhosts.conf"
: Opening httpd.conf file,
: Remove " # "
: LoadModule vhost_alias_module modules/mod_vhost_alias.so
: # Virtual hosts 
: Include conf/extra/httpd-vhosts.conf
*** Opening httpd-vhosts.conf file
#+BEGIN_SRC emacs-lisp
 <VirtualHost 127.0.0.1:80>
     #directory
     DocumentRoot "D:\phpStudy\WWW\ec-shop\gold"
     ServerName local.gold
     #    ServerAlias www.dummy-host.example.com
     #    ErrorLog "logs/dummy-host.example.com-error.log"
     #    CustomLog "logs/dummy-host.example.com-access.log" common
     DirectoryIndex index.html index.htm index.php
     <Directory />
       Options FollowSymLinks
       #不许可别人修改我们的页面
       AllowOverride None
       #设置访问权限
       Order allow,deny
       Allow from all
     </Directory>
 </VirtualHost>
#+END_SRC
*** Opening hosts file
: File location：c:\windows\system32\drivers\etc\hosts
: #add
: 127.0.0.1 local.gold
: Explain:
:       a.About hosts:a computer file to be used to store information on where to find an internet host on a computer network
:       
:       b.When the user input a URL in the browser, the system will automatically search for the corresponding IP address 
:         from the Hosts file, once found, the system will immediately open the corresponding page, if not found, then the 
:         system will be submitted to the DNS domain name resolution server IP address.
*** Access virtual host
: Inputing "local.gold" in the browser. Finished!
** Configure multiple ports and multiple sites
*** httpd.conf
: Add listening port:
:   Listen 81
:   Listen 82
*** httpd-vhosts.conf
: <VirtualHost *:81>
: #    ServerAdmin webmaster@dummy-host2.example.com
:      DocumentRoot "d:\wamp\www\wp-job"
:      ServerName localhost
: #    ErrorLog "logs/dummy-host2.example.com-error.log"
: #    CustomLog "logs/dummy-host2.example.com-access.log" common
: </VirtualHost>
: 
: <VirtualHost *:82>
: #    ServerAdmin webmaster@dummy-host2.example.com
:      DocumentRoot "d:\wamp\www\wordpress"
:      ServerName localhost
: #    ErrorLog "logs/dummy-host2.example.com-error.log"
: #    CustomLog "logs/dummy-host2.example.com-access.log" common
: </VirtualHost>
* Writing in the end
: ...
